ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SPI.cpp
#define SSP1RIS (*(volatile unsigned long *)0x40030018)//0xE0030018)
#define SSP1RIS_OFFSET 0x18
#define SSP1RIS_TXRIS_MASK 0x8
#define SSP1RIS_TXRIS 0x8
#define SSP1RIS_TXRIS_BIT 3
#define SSP1RIS_RXRIS_MASK 0x4
#define SSP1RIS_RXRIS 0x4
#define SSP1RIS_RXRIS_BIT 2
#define SSP1RIS_RTRIS_MASK 0x2
#define SSP1RIS_RTRIS 0x2
#define SSP1RIS_RTRIS_BIT 1
#define SSP1RIS_RORRIS_MASK 0x1
#define SSP1RIS_RORRIS 0x1
#define SSP1RIS_RORRIS_BIT 0

#define SSP1MIS (*(volatile unsigned long *)0x4003001C)//0xE003001C)
#define SSP1MIS_OFFSET 0x1C
#define SSP1MIS_TXMIS_MASK 0x8
#define SSP1MIS_TXMIS 0x8
#define SSP1MIS_TXMIS_BIT 3
#define SSP1MIS_RXMIS_MASK 0x4
#define SSP1MIS_RXMIS 0x4
#define SSP1MIS_RXMIS_BIT 2
#define SSP1MIS_RTMIS_MASK 0x2
#define SSP1MIS_RTMIS 0x2
#define SSP1MIS_RTMIS_BIT 1
#define SSP1MIS_RORMIS_MASK 0x1
#define SSP1MIS_RORMIS 0x1
#define SSP1MIS_RORMIS_BIT 0

#define SSP1ICR (*(volatile unsigned long *)0x40030020)//0xE0030020)
#define SSP1ICR_OFFSET 0x20
#define SSP1ICR_RTIC_MASK 0x2
#define SSP1ICR_RTIC 0x2
#define SSP1ICR_RTIC_BIT 1
#define SSP1ICR_RORIC_MASK 0x1
#define SSP1ICR_RORIC 0x1
#define SSP1ICR_RORIC_BIT 0

#define SSP1DMACR (*(volatile unsigned long *)0x40030024)//0xE0030024)
#define SSP1DMACR_OFFSET 0x24
#define SSP1DMACR_RXDMAE_MASK 0x1
#define SSP1DMACR_RXDMAE 0x1
#define SSP1DMACR_RXDMAE_BIT 0
#define SSP1DMACR_TXDMAE_MASK 0x2
#define SSP1DMACR_TXDMAE 0x2
#define SSP1DMACR_TXDMAE_BIT 1


// SPI2
#define SSP2_BASE 0x400AC000//0x400AC000

#define SSP2CR0 (*(volatile unsigned long *)0x400AC000)//0x400AC000)
#define SSP2CR0_OFFSET 0x0
#define SSP2CR0_SCR_MASK 0xFF00
#define SSP2CR0_SCR_BIT 8
#define SSP2CR0_CPHA_MASK 0x80
#define SSP2CR0_CPHA 0x80
#define SSP2CR0_CPHA_BIT 7
#define SSP2CR0_CPOL_MASK 0x40
#define SSP2CR0_CPOL 0x40
#define SSP2CR0_CPOL_BIT 6
#define SSP2CR0_FRF_MASK 0x30
#define SSP2CR0_FRF_BIT 4
#define SSP2CR0_DSS_MASK 0xF
#define SSP2CR0_DSS_BIT 0

#define SSP2CR1 (*(volatile unsigned long *)0x400AC004)//0x400AC004)
#define SSP2CR1_OFFSET 0x4
#define SSP2CR1_SOD_MASK 0x8
#define SSP2CR1_SOD 0x8
#define SSP2CR1_SOD_BIT 3
#define SSP2CR1_MS_MASK 0x4
#define SSP2CR1_MS 0x4
#define SSP2CR1_MS_BIT 2
#define SSP2CR1_SSE_MASK 0x2
#define SSP2CR1_SSE 0x2
#define SSP2CR1_SSE_BIT 1
#define SSP2CR1_LBE_MASK 0x1
#define SSP2CR1_LBE 0x1
#define SSP2CR1_LBE_BIT 0

#define SSP2DR (*(volatile unsigned long *)0x400AC008)//0x400AC008)
#define SSP2DR_OFFSET 0x8

#define SSP2SR (*(volatile unsigned long *)0x400AC00C)//0x400AC00C)
#define SSP2SR_OFFSET 0xC
#define SSP2SR_BSY_MASK 0x10
#define SSP2SR_BSY 0x10
#define SSP2SR_BSY_BIT 4
#define SSP2SR_RFF_MASK 0x8
#define SSP2SR_RFF 0x8
#define SSP2SR_RFF_BIT 3
#define SSP2SR_RNE_MASK 0x4
#define SSP2SR_RNE 0x4
#define SSP2SR_RNE_BIT 2
#define SSP2SR_TNF_MASK 0x2
#define SSP2SR_TNF 0x2
#define SSP2SR_TNF_BIT 1
#define SSP2SR_TFE_MASK 0x1
#define SSP2SR_TFE 0x1
#define SSP2SR_TFE_BIT 0

#define SSP2CPSR (*(volatile unsigned long *)0x400AC010)//0x400AC010)
#define SSP2CPSR_OFFSET 0x10
#define SSP2CPSR_CPSDVSR_MASK 0xFF
#define SSP2CPSR_CPSDVSR_BIT 0

#define SSP2IMSC (*(volatile unsigned long *)0x400AC014)//0x400AC014)
#define SSP2IMSC_OFFSET 0x14
#define SSP2IMSC_TXIM_MASK 0x8
#define SSP2IMSC_TXIM 0x8
#define SSP2IMSC_TXIM_BIT 3
#define SSP2IMSC_RXIM_MASK 0x4
#define SSP2IMSC_RXIM 0x4
#define SSP2IMSC_RXIM_BIT 2
#define SSP2IMSC_RTIM_MASK 0x2
#define SSP2IMSC_RTIM 0x2
#define SSP2IMSC_RTIM_BIT 1
#define SSP2IMSC_RORIM_MASK 0x1
#define SSP2IMSC_RORIM 0x1
#define SSP2IMSC_RORIM_BIT 0

#define SSP2RIS (*(volatile unsigned long *)0x400AC018)//0x400AC018)
#define SSP2RIS_OFFSET 0x18
#define SSP2RIS_TXRIS_MASK 0x8
#define SSP2RIS_TXRIS 0x8
#define SSP2RIS_TXRIS_BIT 3
#define SSP2RIS_RXRIS_MASK 0x4
#define SSP2RIS_RXRIS 0x4
#define SSP2RIS_RXRIS_BIT 2
#define SSP2RIS_RTRIS_MASK 0x2
#define SSP2RIS_RTRIS 0x2
#define SSP2RIS_RTRIS_BIT 1
#define SSP2RIS_RORRIS_MASK 0x1
#define SSP2RIS_RORRIS 0x1
#define SSP2RIS_RORRIS_BIT 0

#define SSP2MIS (*(volatile unsigned long *)0x400AC01C)//0x400AC01C)
#define SSP2MIS_OFFSET 0x1C
#define SSP2MIS_TXMIS_MASK 0x8
#define SSP2MIS_TXMIS 0x8
#define SSP2MIS_TXMIS_BIT 3
#define SSP2MIS_RXMIS_MASK 0x4
#define SSP2MIS_RXMIS 0x4
#define SSP2MIS_RXMIS_BIT 2
#define SSP2MIS_RTMIS_MASK 0x2
#define SSP2MIS_RTMIS 0x2
#define SSP2MIS_RTMIS_BIT 1
#define SSP2MIS_RORMIS_MASK 0x1
#define SSP2MIS_RORMIS 0x1
#define SSP2MIS_RORMIS_BIT 0

#define SSP2ICR (*(volatile unsigned long *)0x400AC020)//0x400AC020)
#define SSP2ICR_OFFSET 0x20
#define SSP2ICR_RTIC_MASK 0x2
#define SSP2ICR_RTIC 0x2
#define SSP2ICR_RTIC_BIT 1
#define SSP2ICR_RORIC_MASK 0x1
#define SSP2ICR_RORIC 0x1
#define SSP2ICR_RORIC_BIT 0

#define SSP2DMACR (*(volatile unsigned long *)0x400AC024)//0x400AC024)
#define SSP2DMACR_OFFSET 0x24
#define SSP2DMACR_RXDMAE_MASK 0x1
#define SSP2DMACR_RXDMAE 0x1
#define SSP2DMACR_RXDMAE_BIT 0
#define SSP2DMACR_TXDMAE_MASK 0x2
#define SSP2DMACR_TXDMAE 0x2
#define SSP2DMACR_TXDMAE_BIT 1

struct LPC17xx_SPI {
    static const uint32_t c_SPI0_Base = 0x40088000; //0xE0068000;
    static const uint32_t c_SPI1_Base = 0x40030000; // 0xE0030000;
    static const uint32_t c_SPI2_Base = 0x400AC000; // 0x400AC000; // TQD

    static const uint32_t c_SPI_Clk_KHz = (LPC17_SYSTEM_CLOCK_HZ / 2 / 1000);

    static const uint32_t c_SPI0 = 0;
    static const uint32_t c_SPI1 = 1;
    static const uint32_t c_SPI2 = 2;

    volatile uint32_t SSPxCR0;
    volatile uint32_t SSPxCR1;
    volatile uint32_t SSPxDR;
    volatile uint32_t SSPxSR;
    volatile uint32_t SSPxCPSR;

    static const uint32_t CONTROLREG_BitEnable = 0x00000004;
    static const uint32_t CONTROLREG_MODE_Master = 0x00000020;
    static const uint32_t CONTROLREG_PHA_1 = 0x00000008;
    static const uint32_t CONTROLREG_POL_1 = 0x00000010;
};

static const LPC17_Gpio_Pin spiMisoPins[] = LPC17_SPI_MISO_PINS;
static const LPC17_Gpio_Pin spiMosiPins[] = LPC17_SPI_MOSI_PINS;
static const LPC17_Gpio_Pin spiClkPins[] = LPC17_SPI_SCLK_PINS;

struct SpiState {
    int32_t controllerIndex;

