ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SPI.cpp
    uint8_t *readBuffer;
    uint8_t *writeBuffer;

    size_t readLength;
    size_t writeLength;
    size_t readOffset;

    int32_t chipSelectLine;
    int32_t dataBitLength;
    int32_t clockFrequency;

    TinyCLR_Spi_Mode spiMode;

    bool isOpened;
    bool tableInitialized = false;
    uint32_t initializeCount;
};

static SpiState spiStates[TOTAL_SPI_CONTROLLERS];

static TinyCLR_Spi_Controller spiControllers[TOTAL_SPI_CONTROLLERS];
static TinyCLR_Api_Info spiApi[TOTAL_SPI_CONTROLLERS];

void LPC17_Spi_Reset();

const char* spiApiNames[TOTAL_SPI_CONTROLLERS] = {
#if TOTAL_SPI_CONTROLLERS > 0
"GHIElectronics.TinyCLR.NativeApis.LPC17.SpiController\\0",
#if TOTAL_SPI_CONTROLLERS > 1
"GHIElectronics.TinyCLR.NativeApis.LPC17.SpiController\\1",
#if TOTAL_SPI_CONTROLLERS > 2
"GHIElectronics.TinyCLR.NativeApis.LPC17.SpiController\\2",
#endif
#endif
#endif
};

void LPC17_Spi_EnsureTableInitialized() {
    for (auto i = 0; i < TOTAL_SPI_CONTROLLERS; i++) {
        if (spiStates[i].tableInitialized)
            continue;

        spiControllers[i].ApiInfo = &spiApi[i];
        spiControllers[i].Acquire = &LPC17_Spi_Acquire;
        spiControllers[i].Release = &LPC17_Spi_Release;
        spiControllers[i].WriteRead = &LPC17_Spi_WriteRead;
        spiControllers[i].SetActiveSettings = &LPC17_Spi_SetActiveSettings;
        spiControllers[i].GetChipSelectLineCount = &LPC17_Spi_GetChipSelectLineCount;
        spiControllers[i].GetMinClockFrequency = &LPC17_Spi_GetMinClockFrequency;
        spiControllers[i].GetMaxClockFrequency = &LPC17_Spi_GetMaxClockFrequency;
        spiControllers[i].GetSupportedDataBitLengths = &LPC17_Spi_GetSupportedDataBitLengths;

        spiApi[i].Author = "GHI Electronics, LLC";
        spiApi[i].Name = spiApiNames[i];
        spiApi[i].Type = TinyCLR_Api_Type::SpiController;
        spiApi[i].Version = 0;
        spiApi[i].Implementation = &spiControllers[i];
        spiApi[i].State = &spiStates[i];

        spiStates[i].controllerIndex = i;
        spiStates[i].tableInitialized = true;
    }
}

const TinyCLR_Api_Info* LPC17_Spi_GetRequiredApi() {
    LPC17_Spi_EnsureTableInitialized();

    return &spiApi[0];
}

void LPC17_Spi_AddApi(const TinyCLR_Api_Manager* apiManager) {
    LPC17_Spi_EnsureTableInitialized();

    for (auto i = 0; i < TOTAL_SPI_CONTROLLERS; i++) {
        apiManager->Add(apiManager, &spiApi[i]);
    }
}

bool LPC17_Spi_Transaction_Start(int32_t controllerIndex) {
    auto state = &spiStates[controllerIndex];

    LPC17_Gpio_Write(nullptr, state->chipSelectLine, TinyCLR_Gpio_PinValue::Low);
    return true;
}

bool LPC17_Spi_Transaction_Stop(int32_t controllerIndex) {
    auto state = &spiStates[controllerIndex];

    LPC17_Gpio_Write(nullptr, state->chipSelectLine, TinyCLR_Gpio_PinValue::High);
    return true;
}


bool LPC17_Spi_Transaction_nWrite8_nRead8(int32_t controllerIndex) {
    auto state = &spiStates[controllerIndex];

    LPC17xx_SPI & SPI = *(LPC17xx_SPI*)(size_t)((controllerIndex == 0) ? (LPC17xx_SPI::c_SPI0_Base) : ((controllerIndex == 1) ? (LPC17xx_SPI::c_SPI1_Base) : (LPC17xx_SPI::c_SPI2_Base)));

    uint8_t Data8;
    uint8_t* Write8 = state->writeBuffer;
    int32_t WriteCount = state->writeLength;
    uint8_t* Read8 = state->readBuffer;
    int32_t ReadCount = state->readLength;
    int32_t ReadStartOffset = state->readOffset;
    int32_t ReadTotal = 0;

    if (ReadCount) {
        ReadTotal = ReadCount + ReadStartOffset; // we need to read as many bytes as the buffer is long, plus the offset at which we start
    }

    // nothing to read, just write to make it faster
    if (ReadCount == 0) {
        while (WriteCount--) {
            SPI.SSPxDR = *Write8++;
            while ((SPI.SSPxSR & 0x02) == 0);
        }

        // complete and discard anything else
        while (SPI.SSPxSR & 0x01 == 0); // more bytes to transmit
        while (SPI.SSPxSR & 0x10);//BSY

        // get all bytes
        while (SPI.SSPxSR & 0x4) {
            Data8 = SPI.SSPxDR;
            while (SPI.SSPxSR & 0x10);//BSY
        }

        return true;
    }

    int32_t loopCnt = ReadTotal;

    // take the max of Read+offset or WrCnt
    if (loopCnt < WriteCount) {
        loopCnt = WriteCount;
    }
    // we will use WriteCount to move in the Write8 array
    // so we do no want to go past the end when we will check for
    // WriteCount to be bigger than zero
    WriteCount -= 1;

    // Start transmission
    while (loopCnt--) {
        // Write Transmit Data
        SPI.SSPxDR = Write8[0];

        // repeat last write word for all subsequent reads
        if (WriteCount) {
            WriteCount--;
            Write8++;
        }

        // wait while the Transmission is in progress
        // No error checking as there is no mechanism to report errors
        if (controllerIndex == 0) { // SPI 0\
            while (!(SSP0SR & 0x04));//SPIF
            while ((SSP0SR & 0x10));//BSY

        }
        else if (controllerIndex == 1) {
            while (!(SSP1SR & 0x04));//SPIF
            while ((SSP1SR & 0x10));//BSY
        }
        else if (controllerIndex == 2) {
            while (!(SSP2SR & 0x04));//SPIF
            while ((SSP2SR & 0x10));//BSY
        }

        // Read recieved data
        if (controllerIndex == 0) {
            Data8 = ((uint8_t)SSP0DR);

        }
        else if (controllerIndex == 1) {
            Data8 = ((uint8_t)SSP1DR);
        }
        else if (controllerIndex == 2) {
            Data8 = ((uint8_t)SSP2DR);
        }

        // only save data once we have reached ReadCount-1 portion of words
        ReadTotal--;

        if ((ReadTotal >= 0) && (ReadTotal < ReadCount)) {
            Read8[0] = Data8;
            Read8++;
        }
    }

    return true;
}

bool LPC17_Spi_Transaction_nWrite16_nRead16(int32_t controllerIndex) {
    return false;
}

TinyCLR_Result LPC17_Spi_TransferSequential(const TinyCLR_Spi_Controller* self, const uint8_t* writeBuffer, size_t& writeLength, uint8_t* readBuffer, size_t& readLength, bool deselectAfter) {
    if (LPC17_Spi_Write(self, writeBuffer, writeLength) != TinyCLR_Result::Success)
        return TinyCLR_Result::InvalidOperation;

