ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SPI.cpp
    case TinyCLR_Spi_Mode::Mode2: //  CPOL = 1, CPHA = 0.
        SPI.SSPxCR0 |= (1 << 6);
        break;

    case TinyCLR_Spi_Mode::Mode3: // CPOL = 1, CPHA = 1
        SPI.SSPxCR0 |= (1 << 6) | (1 << 7);
        break;
    }

    SPI.SSPxCR0 &= ~(0xFF << 8);
    SPI.SSPxCR0 |= (SCR << 8);

    if (state->chipSelectLine != PIN_NONE) {
        if (LPC17_Gpio_OpenPin(state->chipSelectLine)) {
            LPC17_Gpio_EnableOutputPin(state->chipSelectLine, true);
        }
        else {
            return TinyCLR_Result::SharingViolation;
        }

    }
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Spi_Acquire(const TinyCLR_Spi_Controller* self) {
    auto state = reinterpret_cast<SpiState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) {

        auto controllerIndex = state->controllerIndex;

        uint32_t clkPin, misoPin, mosiPin;

        LPC17_Gpio_PinFunction clkMode, misoMode, mosiMode;

        clkPin = spiClkPins[controllerIndex].number;
        misoPin = spiMisoPins[controllerIndex].number;
        mosiPin = spiMosiPins[controllerIndex].number;

        clkMode = spiClkPins[controllerIndex].pinFunction;
        misoMode = spiMisoPins[controllerIndex].pinFunction;
        mosiMode = spiMosiPins[controllerIndex].pinFunction;

        // Check each pin single time make sure once fail not effect to other pins
        if (!LPC17_Gpio_OpenPin(clkPin))
            return TinyCLR_Result::SharingViolation;

        if (!LPC17_Gpio_OpenPin(misoPin))
            return TinyCLR_Result::SharingViolation;

        if (!LPC17_Gpio_OpenPin(mosiPin))
            return TinyCLR_Result::SharingViolation;

        switch (controllerIndex) {
        case 0:
            LPC_SC->PCONP |= PCONP_PCSSP0;
            break;

        case 1:
            LPC_SC->PCONP |= PCONP_PCSSP1;
            break;

        case 2:
            LPC_SC->PCONP |= PCONP_PCSSP2;
            break;
        }

        LPC17_Gpio_ConfigurePin(clkPin, LPC17_Gpio_Direction::Input, clkMode, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
        LPC17_Gpio_ConfigurePin(misoPin, LPC17_Gpio_Direction::Input, misoMode, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
        LPC17_Gpio_ConfigurePin(mosiPin, LPC17_Gpio_Direction::Input, mosiMode, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);

        state->isOpened = true;
    }

    state->initializeCount++;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Spi_Release(const TinyCLR_Spi_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<SpiState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) return TinyCLR_Result::InvalidOperation;

    state->initializeCount--;

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        switch (controllerIndex) {
        case 0:
            LPC_SC->PCONP &= ~PCONP_PCSSP0;
            break;

        case 1:
            LPC_SC->PCONP &= ~PCONP_PCSSP1;
            break;

        case 2:
            LPC_SC->PCONP &= ~PCONP_PCSSP2;
            break;
        }

        state->clockFrequency = 0;
        state->dataBitLength = 0;

        if (state->isOpened) {
            int32_t clkPin = spiClkPins[controllerIndex].number;
            int32_t misoPin = spiMisoPins[controllerIndex].number;
            int32_t mosiPin = spiMosiPins[controllerIndex].number;

            LPC17_Gpio_ClosePin(clkPin);
            LPC17_Gpio_ClosePin(misoPin);
            LPC17_Gpio_ClosePin(mosiPin);

            if (state->chipSelectLine != PIN_NONE) {
                // Release the pin, set pin un-reserved
                LPC17_Gpio_ClosePin(state->chipSelectLine);

                // Keep chip select is inactive by internal pull up
                LPC17_Gpio_ConfigurePin(state->chipSelectLine, LPC17_Gpio_Direction::Input, LPC17_Gpio_PinFunction::PinFunction0, LPC17_Gpio_ResistorMode::PullUp, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);

                state->chipSelectLine = PIN_NONE;
            }
        }

        state->isOpened = false;
    }

    return TinyCLR_Result::Success;
}

uint32_t LPC17_Spi_GetMinClockFrequency(const TinyCLR_Spi_Controller* self) {
    // CPSDVSR min 2, max 254
    // SCR min 0, max 127
    return (LPC17_AHB_CLOCK_HZ / 2) / (254 * (127 + 1));

}

uint32_t LPC17_Spi_GetMaxClockFrequency(const TinyCLR_Spi_Controller* self) {
    // CPSDVSR min 2, max 254
    // SCR min 0, max 127
    return (LPC17_AHB_CLOCK_HZ / 2) / (2 * (0 + 1));
}

uint32_t LPC17_Spi_GetChipSelectLineCount(const TinyCLR_Spi_Controller* self) {
    // This could maintain a map of the actual pins
    // that are available for a particular port.
    // (Not all pins can be mapped to all ports.)
    // The value of doing that, however, is marginal
    // since the count of possible chip selects doesn't
    // really help in determining which chip select to
    // use so just report the total count of all GPIO
    // pins as possible so that the selected Chip select
    // line coresponds to a GPIO pin number directly
    // without needing any additional translation/mapping.

    return LPC17_Gpio_GetPinCount(nullptr);
}

static const int32_t dataBitsCount = 2;
static int32_t dataBits[dataBitsCount] = { 8, 16 };

TinyCLR_Result LPC17_Spi_GetSupportedDataBitLengths(const TinyCLR_Spi_Controller* self, uint32_t* dataBitLengths, size_t& dataBitLengthsCount) {
    if (dataBitLengths != nullptr)
        memcpy(dataBitLengths, dataBits, (dataBitsCount < dataBitLengthsCount ? dataBitsCount : dataBitLengthsCount) * sizeof(int32_t));

    dataBitLengthsCount = dataBitsCount;

    return TinyCLR_Result::Success;
}

void LPC17_Spi_Reset() {
    for (auto i = 0; i < TOTAL_SPI_CONTROLLERS; i++) {
        LPC17_Spi_Release(&spiControllers[i]);

        spiStates[i].isOpened = false;
        spiStates[i].tableInitialized = false;
        spiStates[i].initializeCount = 0;
    }
}
